base/Catalogs/бит_НастройкиПротоколовРасхожденийБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиПротоколовРасхожденийБюджета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСхемы</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>Бюджет</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Comment>Периодичность</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьКодификаторСтатьи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Измерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Ресурсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/AccumulationRegisters/бит_ОборотыПоБюджетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_ОборотыПоБюджетам</Name>
			<Comment>(БИТ)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте операции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСценарий</Name>
					<Comment>Сумма в валюте сценария</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСценарийЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КлючиСценарийЦФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыЗаписейОборотовПоБюджетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий бюджетирования</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Comment>ЦФО</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов по бюджетам</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_1</Name>
					<Comment>Дополнительная аналитика № 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_2</Name>
					<Comment>Дополнительная аналитика № 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_3</Name>
					<Comment>Дополнительная аналитика № 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_4</Name>
					<Comment>Дополнительная аналитика № 4</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_5</Name>
					<Comment>Дополнительная аналитика № 5</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_6</Name>
					<Comment>Дополнительная аналитика № 6</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_7</Name>
					<Comment>Дополнительная аналитика № 7</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_8</Name>
					<Comment>Дополнительная аналитика № 8</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_9</Name>
					<Comment>Дополнительная аналитика № 9</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_10</Name>
					<Comment>Дополнительная аналитика № 10</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_11</Name>
					<Comment>Дополнительная аналитика № 11</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика_12</Name>
					<Comment>Дополнительная аналитика № 12</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

base/Enums/бит_РасходДоход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_РасходДоход</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расходование</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Catalogs/бит_СтатьиБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СтатьиБюджета</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование элемента справочника для вывода на печать</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Comment>Статья оборотов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>Коэффициент</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Comment>Произвольный код. Используется для вывода в отчетах и печатных формах.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтображать</Name>
					<Comment>Не отображать</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВключатьВИтоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьТекстКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_НастройкиПротоколовРасхожденийБюджета/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
				
КонецПроцедуры // ПриЗаписи()	

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда
		Если Ресурсы.Количество() = 0 Тогда
			
			Показатели = Новый Структура; 
			Показатели.Вставить("Количество", Ложь);
			Показатели.Вставить("СуммаРегл", Истина);
			Показатели.Вставить("СуммаУпр", Ложь);
			Показатели.Вставить("СуммаСценарий", Ложь);
			
			Для каждого Показатель Из Показатели Цикл
				НоваяСтрока = Ресурсы.Добавить();
				НоваяСтрока.Ресурс = Показатель.Ключ;
				НоваяСтрока.Выполнять = Показатель.Значение;
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
	
#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет текст запроса построителя отчета
//            Запрос строится по справочнику, соответствующему измерению бюджетирования.
// 
// Параметры:
//  ИмяИзмерения  - Строка
// 
Функция СформироватьТекстЗапроса() Экспорт
		
	Если ЗначениеЗаполнено(Бюджет) Тогда		
		ТекстЗапроса = СформироватьТекстЗапросаПоБюджету();
	Иначе
		ТекстЗапроса = СформироватьТекстЗапросаПоСтатьямОборотов();
	КонецЕсли; 
	
	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);
	
	СхемаОборотыЭталон 	= Схема.ПакетЗапросов[1];
	СхемаОбороты 		= Схема.ПакетЗапросов[2];
	СхемаВременная 		= Схема.ПакетЗапросов[3]; 
	СхемаФинал 			= Схема.ПакетЗапросов[4]; 
	
	// Удаляем ненужные измерения из запроса
	Для каждого СтрИзмерения Из Измерения Цикл
	
		Если НЕ СтрИзмерения.Выполнять Тогда
			
			УдалитьЭлементВКоллекцииСхемыЗапроса(СхемаОборотыЭталон.Колонки, СтрИзмерения.Имя);
			УдалитьЭлементВКоллекцииСхемыЗапроса(СхемаОбороты.Колонки, СтрИзмерения.Имя);
			УдалитьЭлементВКоллекцииСхемыЗапроса(СхемаВременная.Колонки, СтрИзмерения.Имя);
			УдалитьЭлементВКоллекцииСхемыЗапроса(СхемаФинал.Колонки, СтрИзмерения.Имя);
			
		КонецЕсли; 
	
	КонецЦикла; 
			   
	Возврат Схема.ПолучитьТекстЗапроса();
	
КонецФункции // СформироватьТекстЗапроса()

// Процедура сохраняет настройки построителя
// 
// Параметры:
//  СтруктураНастроек - Структура.
// 
Процедура СохранитьНастройкиПостроителя(СтруктураНастроек)  Экспорт
	
	НастройкаСхемы = Новый ХранилищеЗначения(СтруктураНастроек);
	
КонецПроцедуры // СохранитьНастройки()

// Функция получает настройки построителя.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура.
// 
Функция ПолучитьНастройкиПостроителя() Экспорт
	
	СтруктураНастроек = НастройкаСхемы.Получить();	
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура") Тогда	
		СтруктураНастроек = Новый Структура;	
	КонецЕсли; 	
	
	Возврат СтруктураНастроек;
	
КонецФункции // ПолучитьНастройки()
  
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует текст запроса для заполнения при условии разворота по статья оборотов
// Предусмотрена возможность фильтрации статей по принадлежности к бюджету.
// 
// Возвращаемое значение:
//   ТекстЗапроса   - Строка
// 
Функция СформироватьТекстЗапросаПоСтатьямОборотов()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СтатьиОборотов.Ссылка КАК СтатьяОборотов
	|ПОМЕСТИТЬ СтатьиОборотов
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
	|ГДЕ
	|	бит_СтатьиОборотов.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыЭталон.СтатьяОборотов КАК СтатьяОборотов,
	|	ОборотыЭталон.ЦФО КАК ЦФО,
	|	ОборотыЭталон.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ГОД)
	|		ИНАЧЕ ОборотыЭталон.Период
	|	КОНЕЦ КАК Период,
	|	СУММА(ОборотыЭталон.КоличествоОборот) КАК КоличествоОборотЭталон,
	|	СУММА(ОборотыЭталон.СуммаОборот) КАК СуммаОборотЭталон,
	|	СУММА(ОборотыЭталон.СуммаРеглОборот) КАК СуммаРеглОборотЭталон,
	|	СУММА(ОборотыЭталон.СуммаУпрОборот) КАК СуммаУпрОборотЭталон,
	|	СУММА(ОборотыЭталон.СуммаСценарийОборот) КАК СуммаСценарийОборотЭталон,
	|	ОборотыЭталон.Аналитика_1 КАК Аналитика_1,
	|	ОборотыЭталон.Аналитика_2 КАК Аналитика_2,
	|	ОборотыЭталон.Аналитика_3 КАК Аналитика_3,
	|	ОборотыЭталон.Аналитика_4 КАК Аналитика_4,
	|	ОборотыЭталон.Аналитика_5 КАК Аналитика_5,
	|	ОборотыЭталон.Аналитика_6 КАК Аналитика_6,
	|	ОборотыЭталон.Аналитика_7 КАК Аналитика_7,
	|	ОборотыЭталон.Аналитика_8 КАК Аналитика_8,
	|	ОборотыЭталон.Аналитика_9 КАК Аналитика_9,
	|	ОборотыЭталон.Аналитика_10 КАК Аналитика_10,
	|	ОборотыЭталон.Аналитика_11 КАК Аналитика_11,
	|	ОборотыЭталон.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ ОборотыЭталон
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(&НачалоПериода {(&НачалоПериода)}, &КонецПериода {(&КонецПериода)}, День, Сценарий = &СценарийЭталон) КАК ОборотыЭталон
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыЭталон.СтатьяОборотов,
	|	ОборотыЭталон.ЦФО,
	|	ОборотыЭталон.Валюта,
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ГОД)
	|		ИНАЧЕ ОборотыЭталон.Период
	|	КОНЕЦ,
	|	ОборотыЭталон.Аналитика_1,
	|	ОборотыЭталон.Аналитика_2,
	|	ОборотыЭталон.Аналитика_3,
	|	ОборотыЭталон.Аналитика_4,
	|	ОборотыЭталон.Аналитика_5,
	|	ОборотыЭталон.Аналитика_6,
	|	ОборотыЭталон.Аналитика_7,
	|	ОборотыЭталон.Аналитика_8,
	|	ОборотыЭталон.Аналитика_9,
	|	ОборотыЭталон.Аналитика_10,
	|	ОборотыЭталон.Аналитика_11,
	|	ОборотыЭталон.Аналитика_12
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяОборотов,
	|	ЦФО,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Обороты.СтатьяОборотов КАК СтатьяОборотов,
	|	Обороты.ЦФО КАК ЦФО,
	|	Обороты.Валюта КАК Валюта,
	|	СУММА(Обороты.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(Обороты.СуммаОборот) КАК СуммаОборот,
	|	СУММА(Обороты.СуммаРеглОборот) КАК СуммаРеглОборот,
	|	СУММА(Обороты.СуммаУпрОборот) КАК СуммаУпрОборот,
	|	СУММА(ВЫБОР
	|			КОГДА &ВалютаСценарияЭталон = &ВалютаСценария
	|				ТОГДА ЕСТЬNULL(Обороты.СуммаСценарийОборот, 0)
	|			ИНАЧЕ ЕСТЬNULL(Обороты.СуммаРеглОборот, 0) * ЕСТЬNULL(КурсыВалютСценарияЭталон.Кратность, 0) / ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютСценарияЭталон.Курс, 0) = 0
	|						ТОГДА 1
	|					ИНАЧЕ КурсыВалютСценарияЭталон.Курс
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаСценарийОборот,
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ГОД)
	|		ИНАЧЕ Обороты.Период
	|	КОНЕЦ КАК Период,
	|	Обороты.Аналитика_1 КАК Аналитика_1,
	|	Обороты.Аналитика_2 КАК Аналитика_2,
	|	Обороты.Аналитика_3 КАК Аналитика_3,
	|	Обороты.Аналитика_4 КАК Аналитика_4,
	|	Обороты.Аналитика_5 КАК Аналитика_5,
	|	Обороты.Аналитика_6 КАК Аналитика_6,
	|	Обороты.Аналитика_7 КАК Аналитика_7,
	|	Обороты.Аналитика_8 КАК Аналитика_8,
	|	Обороты.Аналитика_9 КАК Аналитика_9,
	|	Обороты.Аналитика_10 КАК Аналитика_10,
	|	Обороты.Аналитика_11 КАК Аналитика_11,
	|	Обороты.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(&НачалоПериода {(&НачалоПериода)}, &КонецПериода {(&КонецПериода)}, День, Сценарий = &Сценарий) КАК Обороты,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода {(&КонецПериода)}, Валюта = &ВалютаСценарияЭталон) КАК КурсыВалютСценарияЭталон
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.СтатьяОборотов,
	|	Обороты.ЦФО,
	|	Обороты.Валюта,
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ГОД)
	|		ИНАЧЕ Обороты.Период
	|	КОНЕЦ,
	|	Обороты.Аналитика_1,
	|	Обороты.Аналитика_2,
	|	Обороты.Аналитика_3,
	|	Обороты.Аналитика_4,
	|	Обороты.Аналитика_5,
	|	Обороты.Аналитика_6,
	|	Обороты.Аналитика_7,
	|	Обороты.Аналитика_8,
	|	Обороты.Аналитика_9,
	|	Обороты.Аналитика_10,
	|	Обороты.Аналитика_11,
	|	Обороты.Аналитика_12
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяОборотов,
	|	Валюта,
	|	ЦФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ОборотыЭталон.СтатьяОборотов, Обороты.СтатьяОборотов) КАК СтатьяОборотов,
	|	ЕСТЬNULL(ОборотыЭталон.ЦФО, Обороты.ЦФО) КАК ЦФО,
	|	ЕСТЬNULL(ОборотыЭталон.Валюта, Обороты.Валюта) КАК Валюта,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.КоличествоОборотЭталон, 0)) КАК КоличествоОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаОборотЭталон, 0)) КАК СуммаОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаРеглОборотЭталон, 0)) КАК СуммаРеглОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаУпрОборотЭталон, 0)) КАК СуммаУпрОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаСценарийОборотЭталон, 0)) КАК СуммаСценарийОборотЭталон,
	|	СУММА(ЕСТЬNULL(Обороты.КоличествоОборот, 0)) КАК КоличествоОборот,
	|	СУММА(ЕСТЬNULL(Обороты.СуммаОборот, 0)) КАК СуммаОборот,
	|	СУММА(ЕСТЬNULL(Обороты.СуммаРеглОборот, 0)) КАК СуммаРеглОборот,
	|	СУММА(ЕСТЬNULL(Обороты.СуммаУпрОборот, 0)) КАК СуммаУпрОборот,
	|	СУММА(ЕСТЬNULL(Обороты.СуммаСценарийОборот, 0)) КАК СуммаСценарийОборот,
	|	ЕСТЬNULL(ОборотыЭталон.Период, Обороты.Период) КАК Период,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_1, Обороты.Аналитика_1) КАК Аналитика_1,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_2, Обороты.Аналитика_2) КАК Аналитика_2,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_3, Обороты.Аналитика_3) КАК Аналитика_3,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_4, Обороты.Аналитика_4) КАК Аналитика_4,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_5, Обороты.Аналитика_5) КАК Аналитика_5,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_6, Обороты.Аналитика_6) КАК Аналитика_6,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_7, Обороты.Аналитика_7) КАК Аналитика_7,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_8, Обороты.Аналитика_8) КАК Аналитика_8,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_9, Обороты.Аналитика_9) КАК Аналитика_9,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_10, Обороты.Аналитика_10) КАК Аналитика_10,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_11, Обороты.Аналитика_11) КАК Аналитика_11,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_12, Обороты.Аналитика_12) КАК Аналитика_12
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	ОборотыЭталон КАК ОборотыЭталон
	|		ПОЛНОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО ОборотыЭталон.СтатьяОборотов = Обороты.СтатьяОборотов
	|			И ОборотыЭталон.ЦФО = Обороты.ЦФО
	|			И ОборотыЭталон.Валюта = Обороты.Валюта
	|			И ОборотыЭталон.Период = Обороты.Период
	|			И ОборотыЭталон.Аналитика_1 = Обороты.Аналитика_1
	|			И ОборотыЭталон.Аналитика_2 = Обороты.Аналитика_2
	|			И ОборотыЭталон.Аналитика_3 = Обороты.Аналитика_3
	|			И ОборотыЭталон.Аналитика_4 = Обороты.Аналитика_4
	|			И ОборотыЭталон.Аналитика_5 = Обороты.Аналитика_5
	|			И ОборотыЭталон.Аналитика_6 = Обороты.Аналитика_6
	|			И ОборотыЭталон.Аналитика_7 = Обороты.Аналитика_7
	|			И ОборотыЭталон.Аналитика_8 = Обороты.Аналитика_8
	|			И ОборотыЭталон.Аналитика_9 = Обороты.Аналитика_9
	|			И ОборотыЭталон.Аналитика_10 = Обороты.Аналитика_10
	|			И ОборотыЭталон.Аналитика_11 = Обороты.Аналитика_11
	|			И ОборотыЭталон.Аналитика_12 = Обороты.Аналитика_12
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ОборотыЭталон.СтатьяОборотов, Обороты.СтатьяОборотов),
	|	ЕСТЬNULL(ОборотыЭталон.ЦФО, Обороты.ЦФО),
	|	ЕСТЬNULL(ОборотыЭталон.Валюта, Обороты.Валюта),
	|	ЕСТЬNULL(ОборотыЭталон.Период, Обороты.Период),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_1, Обороты.Аналитика_1),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_2, Обороты.Аналитика_2),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_3, Обороты.Аналитика_3),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_4, Обороты.Аналитика_4),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_5, Обороты.Аналитика_5),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_6, Обороты.Аналитика_6),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_7, Обороты.Аналитика_7),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_8, Обороты.Аналитика_8),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_9, Обороты.Аналитика_9),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_10, Обороты.Аналитика_10),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_11, Обороты.Аналитика_11),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_12, Обороты.Аналитика_12)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиОборотов.СтатьяОборотов КАК СтатьяОборотов,
	|	ВременнаяТаблица.ЦФО КАК ЦФО,
	|	ВременнаяТаблица.Валюта КАК Валюта,
	|	СУММА(ВременнаяТаблица.КоличествоОборотЭталон) КАК КоличествоПлан,
	|	СУММА(ВременнаяТаблица.СуммаОборотЭталон) КАК СуммаОборотЭталон,
	|	СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон) КАК СуммаРеглПлан,
	|	СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон) КАК СуммаУпрПлан,
	|	СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон) КАК СуммаСценарийПлан,
	|	СУММА(ВременнаяТаблица.КоличествоОборот) КАК КоличествоФакт,
	|	СУММА(ВременнаяТаблица.СуммаОборот) КАК СуммаОборот,
	|	СУММА(ВременнаяТаблица.СуммаРеглОборот) КАК СуммаРеглФакт,
	|	СУММА(ВременнаяТаблица.СуммаУпрОборот) КАК СуммаУпрФакт,
	|	СУММА(ВременнаяТаблица.СуммаСценарийОборот) КАК СуммаСценарийФакт,
	|	СУММА(ВЫБОР
	|			КОГДА СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|				ТОГДА -ЕСТЬNULL(ВременнаяТаблица.КоличествоОборот, 0) + ЕСТЬNULL(ВременнаяТаблица.КоличествоОборотЭталон, 0)
	|			ИНАЧЕ ЕСТЬNULL(ВременнаяТаблица.КоличествоОборот, 0) - ЕСТЬNULL(ВременнаяТаблица.КоличествоОборотЭталон, 0)
	|		КОНЕЦ) КАК КоличествоОтклонениеАбс,
	|	ВЫБОР
	|		КОГДА СУММА(ВременнаяТаблица.КоличествоОборотЭталон) <> 0
	|				И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|			ТОГДА 100 * (СУММА(ВременнаяТаблица.КоличествоОборотЭталон) - СУММА(ВременнаяТаблица.КоличествоОборот)) / СУММА(ВременнаяТаблица.КоличествоОборотЭталон)
	|		КОГДА СУММА(ВременнаяТаблица.КоличествоОборотЭталон) <> 0
	|				И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|			ТОГДА -100 * (СУММА(ВременнаяТаблица.КоличествоОборотЭталон) - СУММА(ВременнаяТаблица.КоличествоОборот)) / СУММА(ВременнаяТаблица.КоличествоОборотЭталон)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(ВременнаяТаблица.КоличествоОборот) <> 0
	|						И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|					ТОГДА -100
	|				КОГДА СУММА(ВременнаяТаблица.КоличествоОборот) <> 0
	|						И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|					ТОГДА 100
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеОтн,
	|	СУММА(ВЫБОР
	|			КОГДА СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|				ТОГДА -ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборот, 0) + ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборотЭталон, 0)
	|			ИНАЧЕ ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборот, 0) - ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборотЭталон, 0)
	|		КОНЕЦ) КАК СуммаРеглОтклонениеАбс,
	|	ВЫБОР
	|		КОГДА СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон) <> 0
	|				И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|			ТОГДА 100 * (СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон) - СУММА(ВременнаяТаблица.СуммаРеглОборот)) / СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон)
	|		КОГДА СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон) <> 0
	|				И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|			ТОГДА -100 * (СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон) - СУММА(ВременнаяТаблица.СуммаРеглОборот)) / СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(ВременнаяТаблица.СуммаРеглОборот) <> 0
	|						И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|					ТОГДА -100
	|				КОГДА СУММА(ВременнаяТаблица.СуммаРеглОборот) <> 0
	|						И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|					ТОГДА 100
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаРеглОтклонениеОтн,
	|	СУММА(ВЫБОР
	|			КОГДА СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|				ТОГДА -ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборот, 0) + ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборотЭталон, 0)
	|			ИНАЧЕ ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборот, 0) - ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборотЭталон, 0)
	|		КОНЕЦ) КАК СуммаУпрОтклонениеАбс,
	|	ВЫБОР
	|		КОГДА СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон) <> 0
	|				И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|			ТОГДА 100 * (СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон) - СУММА(ВременнаяТаблица.СуммаУпрОборот)) / СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон)
	|		КОГДА СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон) <> 0
	|				И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|			ТОГДА -100 * (СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон) - СУММА(ВременнаяТаблица.СуммаУпрОборот)) / СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(ВременнаяТаблица.СуммаУпрОборот) <> 0
	|						И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|					ТОГДА -100
	|				КОГДА СУММА(ВременнаяТаблица.СуммаУпрОборот) <> 0
	|						И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|					ТОГДА 100
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаУпрОтклонениеОтн,
	|	СУММА(ВЫБОР
	|			КОГДА СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|				ТОГДА -ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборот, 0) + ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборотЭталон, 0)
	|			ИНАЧЕ ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборот, 0) - ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборотЭталон, 0)
	|		КОНЕЦ) КАК СуммаСценарийОтклонениеАбс,
	|	ВЫБОР
	|		КОГДА СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон) <> 0
	|				И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|			ТОГДА 100 * (СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон) - СУММА(ВременнаяТаблица.СуммаСценарийОборот)) / СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон)
	|		КОГДА СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон) <> 0
	|				И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|			ТОГДА -100 * (СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон) - СУММА(ВременнаяТаблица.СуммаСценарийОборот)) / СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(ВременнаяТаблица.СуммаСценарийОборот) <> 0
	|						И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|					ТОГДА -100
	|				КОГДА СУММА(ВременнаяТаблица.СуммаСценарийОборот) <> 0
	|						И СтатьиОборотов.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|					ТОГДА 100
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаСценарийОтклонениеОтн,
	|	ВременнаяТаблица.Период КАК Период,
	|	ВременнаяТаблица.Аналитика_1 КАК Аналитика_1,
	|	ВременнаяТаблица.Аналитика_2 КАК Аналитика_2,
	|	ВременнаяТаблица.Аналитика_3 КАК Аналитика_3,
	|	ВременнаяТаблица.Аналитика_4 КАК Аналитика_4,
	|	ВременнаяТаблица.Аналитика_5 КАК Аналитика_5,
	|	ВременнаяТаблица.Аналитика_6 КАК Аналитика_6,
	|	ВременнаяТаблица.Аналитика_7 КАК Аналитика_7,
	|	ВременнаяТаблица.Аналитика_8 КАК Аналитика_8,
	|	ВременнаяТаблица.Аналитика_9 КАК Аналитика_9,
	|	ВременнаяТаблица.Аналитика_10 КАК Аналитика_10,
	|	ВременнаяТаблица.Аналитика_11 КАК Аналитика_11,
	|	ВременнаяТаблица.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	СтатьиОборотов КАК СтатьиОборотов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО СтатьиОборотов.СтатьяОборотов = ВременнаяТаблица.СтатьяОборотов
	|ГДЕ
	|	(ЕСТЬNULL(ВременнаяТаблица.КоличествоОборотЭталон, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаОборотЭталон, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборотЭталон, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборотЭталон, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборотЭталон, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.КоличествоОборот, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаОборот, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборот, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборот, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборот, 0) <> 0)
	|	И ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборот, 0) - ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборотЭталон, 0) <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатьиОборотов.СтатьяОборотов,
	|	ВременнаяТаблица.Период,
	|	ВременнаяТаблица.ЦФО,
	|	ВременнаяТаблица.Валюта,
	|	ВременнаяТаблица.Аналитика_1,
	|	ВременнаяТаблица.Аналитика_2,
	|	ВременнаяТаблица.Аналитика_3,
	|	ВременнаяТаблица.Аналитика_4,
	|	ВременнаяТаблица.Аналитика_5,
	|	ВременнаяТаблица.Аналитика_6,
	|	ВременнаяТаблица.Аналитика_7,
	|	ВременнаяТаблица.Аналитика_8,
	|	ВременнаяТаблица.Аналитика_9,
	|	ВременнаяТаблица.Аналитика_10,
	|	ВременнаяТаблица.Аналитика_11,
	|	ВременнаяТаблица.Аналитика_12,
	|	СтатьиОборотов.СтатьяОборотов.РасходДоход";

	Возврат ТекстЗапроса;
	
КонецФункции // СформироватьТекстЗапросаПоСтатьямОборотов()

// Функция формирует текст запроса по бюджету для заполнения формы ввода бюджета
// 
// Возвращаемое значение:
//  ТекстЗапроса - Строка.
// 
Функция СформироватьТекстЗапросаПоБюджету()

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиБюджета.Ссылка КАК СтатьяБюджета,
	|	СтатьиБюджета.СтатьяОборотов КАК СтатьяОборотов,
	|	СтатьиБюджета.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ СтатьиБюджета
	|ИЗ
	|	Справочник.бит_СтатьиБюджета КАК СтатьиБюджета
	|ГДЕ
	|	СтатьиБюджета.Владелец = &Бюджет
	|	И НЕ СтатьиБюджета.СтатьяОборотов ЕСТЬ NULL
	|	И НЕ СтатьиБюджета.НеОтображать
	|	И НЕ СтатьиБюджета.ПометкаУдаления
	|	И СтатьиБюджета.ЭтоГруппа = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиБюджета.СтатьяБюджета КАК СтатьяБюджета,
	|	СтатьиБюджета.СтатьяОборотов КАК СтатьяОборотов,
	|	ОборотыЭталон.ЦФО КАК ЦФО,
	|	ОборотыЭталон.Валюта КАК Валюта,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.КоличествоОборот, 0)) КАК КоличествоОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаОборот, 0)) КАК СуммаОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаРеглОборот, 0)) КАК СуммаРеглОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаУпрОборот, 0)) КАК СуммаУпрОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаСценарийОборот, 0)) КАК СуммаСценарийОборотЭталон,
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ГОД)
	|		ИНАЧЕ ОборотыЭталон.Период
	|	КОНЕЦ КАК Период,
	|	ОборотыЭталон.Аналитика_1 КАК Аналитика_1,
	|	ОборотыЭталон.Аналитика_2 КАК Аналитика_2,
	|	ОборотыЭталон.Аналитика_3 КАК Аналитика_3,
	|	ОборотыЭталон.Аналитика_4 КАК Аналитика_4,
	|	ОборотыЭталон.Аналитика_5 КАК Аналитика_5,
	|	ОборотыЭталон.Аналитика_6 КАК Аналитика_6,
	|	ОборотыЭталон.Аналитика_7 КАК Аналитика_7,
	|	ОборотыЭталон.Аналитика_8 КАК Аналитика_8,
	|	ОборотыЭталон.Аналитика_9 КАК Аналитика_9,
	|	ОборотыЭталон.Аналитика_10 КАК Аналитика_10,
	|	ОборотыЭталон.Аналитика_11 КАК Аналитика_11,
	|	ОборотыЭталон.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ ОборотыЭталон
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	|			&НачалоПериода {(&НачалоПериода)},
	|			&КонецПериода {(&КонецПериода)},
	|			День,
	|			СтатьяОборотов В
	|					(ВЫБРАТЬ
	|						СтатьиБюджета.СтатьяОборотов
	|					ИЗ
	|						СтатьиБюджета КАК СтатьиБюджета)
	|				И Сценарий = &СценарийЭталон) КАК ОборотыЭталон
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатьиБюджета КАК СтатьиБюджета
	|		ПО ОборотыЭталон.СтатьяОборотов = СтатьиБюджета.СтатьяОборотов
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыЭталон.Валюта,
	|	СтатьиБюджета.СтатьяБюджета,
	|	СтатьиБюджета.СтатьяОборотов,
	|	ОборотыЭталон.ЦФО,
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(ОборотыЭталон.Период, ГОД)
	|		ИНАЧЕ ОборотыЭталон.Период
	|	КОНЕЦ,
	|	ОборотыЭталон.Аналитика_1,
	|	ОборотыЭталон.Аналитика_2,
	|	ОборотыЭталон.Аналитика_3,
	|	ОборотыЭталон.Аналитика_4,
	|	ОборотыЭталон.Аналитика_5,
	|	ОборотыЭталон.Аналитика_6,
	|	ОборотыЭталон.Аналитика_7,
	|	ОборотыЭталон.Аналитика_8,
	|	ОборотыЭталон.Аналитика_9,
	|	ОборотыЭталон.Аналитика_10,
	|	ОборотыЭталон.Аналитика_11,
	|	ОборотыЭталон.Аналитика_12
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяБюджета,
	|	СтатьяОборотов,
	|	ЦФО,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиБюджета.СтатьяБюджета КАК СтатьяБюджета,
	|	СтатьиБюджета.СтатьяОборотов КАК СтатьяОборотов,
	|	Обороты.ЦФО КАК ЦФО,
	|	Обороты.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ГОД)
	|		ИНАЧЕ Обороты.Период
	|	КОНЕЦ КАК Период,
	|	СУММА(ЕСТЬNULL(Обороты.КоличествоОборот, 0)) КАК КоличествоОборот,
	|	СУММА(ЕСТЬNULL(Обороты.СуммаОборот, 0)) КАК СуммаОборот,
	|	СУММА(ЕСТЬNULL(Обороты.СуммаРеглОборот, 0)) КАК СуммаРеглОборот,
	|	СУММА(ЕСТЬNULL(Обороты.СуммаУпрОборот, 0)) КАК СуммаУпрОборот,
	|	СУММА(ВЫБОР
	|			КОГДА &ВалютаСценарияЭталон = &ВалютаСценария
	|				ТОГДА ЕСТЬNULL(Обороты.СуммаСценарийОборот, 0)
	|			ИНАЧЕ ЕСТЬNULL(Обороты.СуммаРеглОборот, 0) * ЕСТЬNULL(КурсыВалютСценарияЭталон.Кратность, 0) / ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютСценарияЭталон.Курс, 0) = 0
	|						ТОГДА 1
	|					ИНАЧЕ КурсыВалютСценарияЭталон.Курс
	|				КОНЕЦ
	|		КОНЕЦ) КАК СуммаСценарийОборот,
	|	Обороты.Аналитика_1 КАК Аналитика_1,
	|	Обороты.Аналитика_2 КАК Аналитика_2,
	|	Обороты.Аналитика_3 КАК Аналитика_3,
	|	Обороты.Аналитика_4 КАК Аналитика_4,
	|	Обороты.Аналитика_5 КАК Аналитика_5,
	|	Обороты.Аналитика_6 КАК Аналитика_6,
	|	Обороты.Аналитика_7 КАК Аналитика_7,
	|	Обороты.Аналитика_8 КАК Аналитика_8,
	|	Обороты.Аналитика_9 КАК Аналитика_9,
	|	Обороты.Аналитика_10 КАК Аналитика_10,
	|	Обороты.Аналитика_11 КАК Аналитика_11,
	|	Обороты.Аналитика_12 КАК Аналитика_12
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_ОборотыПоБюджетам.Обороты(
	|			&НачалоПериода {(&НачалоПериода)},
	|			&КонецПериода {(&КонецПериода)},
	|			День,
	|			СтатьяОборотов В
	|					(ВЫБРАТЬ
	|						СтатьиБюджета.СтатьяОборотов
	|					ИЗ
	|						СтатьиБюджета КАК СтатьиБюджета)
	|				И Сценарий = &Сценарий) КАК Обороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтатьиБюджета КАК СтатьиБюджета
	|		ПО Обороты.СтатьяОборотов = СтатьиБюджета.СтатьяОборотов,
	|	РегистрСведений.КурсыВалют.СрезПоследних(&КонецПериода {(&КонецПериода)}, Валюта = &ВалютаСценарияЭталон) КАК КурсыВалютСценарияЭталон
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатьиБюджета.СтатьяБюджета,
	|	СтатьиБюджета.СтатьяОборотов,
	|	Обороты.ЦФО,
	|	Обороты.Валюта,
	|	ВЫБОР
	|		КОГДА &Периодичность = 6
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ДЕНЬ)
	|		КОГДА &Периодичность = 7
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, НЕДЕЛЯ)
	|		КОГДА &Периодичность = 8
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ДЕКАДА)
	|		КОГДА &Периодичность = 9
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, МЕСЯЦ)
	|		КОГДА &Периодичность = 10
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, КВАРТАЛ)
	|		КОГДА &Периодичность = 11
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ПОЛУГОДИЕ)
	|		КОГДА &Периодичность = 12
	|			ТОГДА НАЧАЛОПЕРИОДА(Обороты.Период, ГОД)
	|		ИНАЧЕ Обороты.Период
	|	КОНЕЦ,
	|	Обороты.Аналитика_1,
	|	Обороты.Аналитика_2,
	|	Обороты.Аналитика_3,
	|	Обороты.Аналитика_4,
	|	Обороты.Аналитика_5,
	|	Обороты.Аналитика_6,
	|	Обороты.Аналитика_7,
	|	Обороты.Аналитика_8,
	|	Обороты.Аналитика_9,
	|	Обороты.Аналитика_10,
	|	Обороты.Аналитика_11,
	|	Обороты.Аналитика_12
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяБюджета,
	|	СтатьяОборотов,
	|	ЦФО,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ОборотыЭталон.СтатьяБюджета, Обороты.СтатьяБюджета) КАК СтатьяБюджета,
	|	ЕСТЬNULL(ОборотыЭталон.СтатьяОборотов, Обороты.СтатьяОборотов) КАК СтатьяОборотов,
	|	ЕСТЬNULL(ОборотыЭталон.ЦФО, Обороты.ЦФО) КАК ЦФО,
	|	ЕСТЬNULL(ОборотыЭталон.Период, Обороты.Период) КАК Период,
	|	ЕСТЬNULL(ОборотыЭталон.Валюта, Обороты.Валюта) КАК Валюта,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.КоличествоОборотЭталон, 0)) КАК КоличествоОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаОборотЭталон, 0)) КАК СуммаОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаРеглОборотЭталон, 0)) КАК СуммаРеглОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаУпрОборотЭталон, 0)) КАК СуммаУпрОборотЭталон,
	|	СУММА(ЕСТЬNULL(ОборотыЭталон.СуммаСценарийОборотЭталон, 0)) КАК СуммаСценарийОборотЭталон,
	|	СУММА(ЕСТЬNULL(Обороты.КоличествоОборот, 0)) КАК КоличествоОборот,
	|	СУММА(ЕСТЬNULL(Обороты.СуммаОборот, 0)) КАК СуммаОборот,
	|	СУММА(ЕСТЬNULL(Обороты.СуммаРеглОборот, 0)) КАК СуммаРеглОборот,
	|	СУММА(ЕСТЬNULL(Обороты.СуммаУпрОборот, 0)) КАК СуммаУпрОборот,
	|	СУММА(ЕСТЬNULL(Обороты.СуммаСценарийОборот, 0)) КАК СуммаСценарийОборот,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_1, Обороты.Аналитика_1) КАК Аналитика_1,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_2, Обороты.Аналитика_2) КАК Аналитика_2,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_3, Обороты.Аналитика_3) КАК Аналитика_3,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_4, Обороты.Аналитика_4) КАК Аналитика_4,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_5, Обороты.Аналитика_5) КАК Аналитика_5,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_6, Обороты.Аналитика_6) КАК Аналитика_6,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_7, Обороты.Аналитика_7) КАК Аналитика_7,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_8, Обороты.Аналитика_8) КАК Аналитика_8,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_9, Обороты.Аналитика_9) КАК Аналитика_9,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_10, Обороты.Аналитика_10) КАК Аналитика_10,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_11, Обороты.Аналитика_11) КАК Аналитика_11,
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_12, Обороты.Аналитика_12) КАК Аналитика_12
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	ОборотыЭталон КАК ОборотыЭталон
	|		ПОЛНОЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО ОборотыЭталон.СтатьяБюджета = Обороты.СтатьяБюджета
	|			И ОборотыЭталон.СтатьяОборотов = Обороты.СтатьяОборотов
	|			И ОборотыЭталон.ЦФО = Обороты.ЦФО
	|			И ОборотыЭталон.Валюта = Обороты.Валюта
	|			И ОборотыЭталон.Период = Обороты.Период
	|			И ОборотыЭталон.Аналитика_1 = Обороты.Аналитика_1
	|			И ОборотыЭталон.Аналитика_2 = Обороты.Аналитика_2
	|			И ОборотыЭталон.Аналитика_3 = Обороты.Аналитика_3
	|			И ОборотыЭталон.Аналитика_4 = Обороты.Аналитика_4
	|			И ОборотыЭталон.Аналитика_5 = Обороты.Аналитика_5
	|			И ОборотыЭталон.Аналитика_6 = Обороты.Аналитика_6
	|			И ОборотыЭталон.Аналитика_7 = Обороты.Аналитика_7
	|			И ОборотыЭталон.Аналитика_8 = Обороты.Аналитика_8
	|			И ОборотыЭталон.Аналитика_9 = Обороты.Аналитика_9
	|			И ОборотыЭталон.Аналитика_10 = Обороты.Аналитика_10
	|			И ОборотыЭталон.Аналитика_11 = Обороты.Аналитика_11
	|			И ОборотыЭталон.Аналитика_12 = Обороты.Аналитика_12
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ОборотыЭталон.Период, Обороты.Период),
	|	ЕСТЬNULL(ОборотыЭталон.СтатьяБюджета, Обороты.СтатьяБюджета),
	|	ЕСТЬNULL(ОборотыЭталон.СтатьяОборотов, Обороты.СтатьяОборотов),
	|	ЕСТЬNULL(ОборотыЭталон.ЦФО, Обороты.ЦФО),
	|	ЕСТЬNULL(ОборотыЭталон.Валюта, Обороты.Валюта),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_1, Обороты.Аналитика_1),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_2, Обороты.Аналитика_2),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_3, Обороты.Аналитика_3),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_4, Обороты.Аналитика_4),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_5, Обороты.Аналитика_5),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_6, Обороты.Аналитика_6),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_7, Обороты.Аналитика_7),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_8, Обороты.Аналитика_8),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_9, Обороты.Аналитика_9),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_10, Обороты.Аналитика_10),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_11, Обороты.Аналитика_11),
	|	ЕСТЬNULL(ОборотыЭталон.Аналитика_12, Обороты.Аналитика_12)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиБюджета.СтатьяБюджета КАК СтатьяБюджета,
	|	СтатьиБюджета.СтатьяОборотов КАК СтатьяОборотов,
	|	ВременнаяТаблица.ЦФО КАК ЦФО,
	|	ВременнаяТаблица.Период КАК Период,
	|	ВременнаяТаблица.Валюта КАК Валюта,
	|	СУММА(ВременнаяТаблица.КоличествоОборотЭталон) КАК КоличествоПлан,
	|	СУММА(ВременнаяТаблица.СуммаОборотЭталон) КАК СуммаОборотЭталон,
	|	СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон) КАК СуммаРеглПлан,
	|	СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон) КАК СуммаУпрПлан,
	|	СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон) КАК СуммаСценарийПлан,
	|	СУММА(ВременнаяТаблица.КоличествоОборот) КАК КоличествоФакт,
	|	СУММА(ВременнаяТаблица.СуммаОборот) КАК СуммаОборот,
	|	СУММА(ВременнаяТаблица.СуммаРеглОборот) КАК СуммаРеглФакт,
	|	СУММА(ВременнаяТаблица.СуммаУпрОборот) КАК СуммаУпрФакт,
	|	СУММА(ВременнаяТаблица.СуммаСценарийОборот) КАК СуммаСценарийФакт,
	|	СУММА(ВЫБОР
	|			КОГДА СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|				ТОГДА -ЕСТЬNULL(ВременнаяТаблица.КоличествоОборот, 0) + ЕСТЬNULL(ВременнаяТаблица.КоличествоОборотЭталон, 0)
	|			ИНАЧЕ ЕСТЬNULL(ВременнаяТаблица.КоличествоОборот, 0) - ЕСТЬNULL(ВременнаяТаблица.КоличествоОборотЭталон, 0)
	|		КОНЕЦ) КАК КоличествоОтклонениеАбс,
	|	ВЫБОР
	|		КОГДА СУММА(ВременнаяТаблица.КоличествоОборотЭталон) <> 0
	|				И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|			ТОГДА 100 * (СУММА(ВременнаяТаблица.КоличествоОборотЭталон) - СУММА(ВременнаяТаблица.КоличествоОборот)) / СУММА(ВременнаяТаблица.КоличествоОборотЭталон)
	|		КОГДА СУММА(ВременнаяТаблица.КоличествоОборотЭталон) <> 0
	|				И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|			ТОГДА -100 * (СУММА(ВременнаяТаблица.КоличествоОборотЭталон) - СУММА(ВременнаяТаблица.КоличествоОборот)) / СУММА(ВременнаяТаблица.КоличествоОборотЭталон)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(ВременнаяТаблица.КоличествоОборот) <> 0
	|						И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|					ТОГДА -100
	|				КОГДА СУММА(ВременнаяТаблица.КоличествоОборот) <> 0
	|						И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|					ТОГДА 100
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК КоличествоОтклонениеОтн,
	|	СУММА(ВЫБОР
	|			КОГДА СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|				ТОГДА -ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборот, 0) + ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборотЭталон, 0)
	|			ИНАЧЕ ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборот, 0) - ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборотЭталон, 0)
	|		КОНЕЦ) КАК СуммаРеглОтклонениеАбс,
	|	ВЫБОР
	|		КОГДА СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон) <> 0
	|				И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|			ТОГДА 100 * (СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон) - СУММА(ВременнаяТаблица.СуммаРеглОборот)) / СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон)
	|		КОГДА СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон) <> 0
	|				И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|			ТОГДА -100 * (СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон) - СУММА(ВременнаяТаблица.СуммаРеглОборот)) / СУММА(ВременнаяТаблица.СуммаРеглОборотЭталон)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(ВременнаяТаблица.СуммаРеглОборот) <> 0
	|						И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|					ТОГДА -100
	|				КОГДА СУММА(ВременнаяТаблица.СуммаРеглОборот) <> 0
	|						И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|					ТОГДА 100
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаРеглОтклонениеОтн,
	|	СУММА(ВЫБОР
	|			КОГДА СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|				ТОГДА -ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборот, 0) + ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборотЭталон, 0)
	|			ИНАЧЕ ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборот, 0) - ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборотЭталон, 0)
	|		КОНЕЦ) КАК СуммаУпрОтклонениеАбс,
	|	ВЫБОР
	|		КОГДА СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон) <> 0
	|				И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|			ТОГДА 100 * (СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон) - СУММА(ВременнаяТаблица.СуммаУпрОборот)) / СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон)
	|		КОГДА СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон) <> 0
	|				И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|			ТОГДА -100 * (СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон) - СУММА(ВременнаяТаблица.СуммаУпрОборот)) / СУММА(ВременнаяТаблица.СуммаУпрОборотЭталон)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(ВременнаяТаблица.СуммаУпрОборот) <> 0
	|						И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|					ТОГДА -100
	|				КОГДА СУММА(ВременнаяТаблица.СуммаУпрОборот) <> 0
	|						И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|					ТОГДА 100
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаУпрОтклонениеОтн,
	|	СУММА(ВЫБОР
	|			КОГДА СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|				ТОГДА -ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборот, 0) + ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборотЭталон, 0)
	|			ИНАЧЕ ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборот, 0) - ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборотЭталон, 0)
	|		КОНЕЦ) КАК СуммаСценарийОтклонениеАбс,
	|	ВЫБОР
	|		КОГДА СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон) <> 0
	|				И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|			ТОГДА 100 * (СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон) - СУММА(ВременнаяТаблица.СуммаСценарийОборот)) / СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон)
	|		КОГДА СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон) <> 0
	|				И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|			ТОГДА -100 * (СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон) - СУММА(ВременнаяТаблица.СуммаСценарийОборот)) / СУММА(ВременнаяТаблица.СуммаСценарийОборотЭталон)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СУММА(ВременнаяТаблица.СуммаСценарийОборот) <> 0
	|						И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Расходование)
	|					ТОГДА -100
	|				КОГДА СУММА(ВременнаяТаблица.СуммаСценарийОборот) <> 0
	|						И СтатьиБюджета.СтатьяОборотов.РасходДоход = ЗНАЧЕНИЕ(Перечисление.бит_РасходДоход.Поступление)
	|					ТОГДА 100
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаСценарийОтклонениеОтн,
	|	ВременнаяТаблица.Аналитика_1 КАК Аналитика_1,
	|	ВременнаяТаблица.Аналитика_2 КАК Аналитика_2,
	|	ВременнаяТаблица.Аналитика_3 КАК Аналитика_3,
	|	ВременнаяТаблица.Аналитика_4 КАК Аналитика_4,
	|	ВременнаяТаблица.Аналитика_5 КАК Аналитика_5,
	|	ВременнаяТаблица.Аналитика_6 КАК Аналитика_6,
	|	ВременнаяТаблица.Аналитика_7 КАК Аналитика_7,
	|	ВременнаяТаблица.Аналитика_8 КАК Аналитика_8,
	|	ВременнаяТаблица.Аналитика_9 КАК Аналитика_9,
	|	ВременнаяТаблица.Аналитика_10 КАК Аналитика_10,
	|	ВременнаяТаблица.Аналитика_11 КАК Аналитика_11,
	|	ВременнаяТаблица.Аналитика_12 КАК Аналитика_12
	|ИЗ
	|	СтатьиБюджета КАК СтатьиБюджета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
	|		ПО СтатьиБюджета.СтатьяБюджета = ВременнаяТаблица.СтатьяБюджета
	|			И СтатьиБюджета.СтатьяОборотов = ВременнаяТаблица.СтатьяОборотов
	|ГДЕ
	|	(ЕСТЬNULL(ВременнаяТаблица.КоличествоОборотЭталон, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаОборотЭталон, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборотЭталон, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборотЭталон, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборотЭталон, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.КоличествоОборот, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаОборот, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборот, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаУпрОборот, 0) <> 0
	|			ИЛИ ЕСТЬNULL(ВременнаяТаблица.СуммаСценарийОборот, 0) <> 0)
	|	И ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборот, 0) - ЕСТЬNULL(ВременнаяТаблица.СуммаРеглОборотЭталон, 0) <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатьиБюджета.СтатьяБюджета,
	|	СтатьиБюджета.СтатьяОборотов,
	|	ВременнаяТаблица.ЦФО,
	|	ВременнаяТаблица.Период,
	|	ВременнаяТаблица.Валюта,
	|	ВременнаяТаблица.Аналитика_1,
	|	ВременнаяТаблица.Аналитика_2,
	|	ВременнаяТаблица.Аналитика_3,
	|	ВременнаяТаблица.Аналитика_4,
	|	ВременнаяТаблица.Аналитика_5,
	|	ВременнаяТаблица.Аналитика_6,
	|	ВременнаяТаблица.Аналитика_7,
	|	ВременнаяТаблица.Аналитика_8,
	|	ВременнаяТаблица.Аналитика_9,
	|	ВременнаяТаблица.Аналитика_10,
	|	ВременнаяТаблица.Аналитика_11,
	|	ВременнаяТаблица.Аналитика_12,
	|	СтатьиБюджета.СтатьяОборотов.РасходДоход";
	
	Возврат ТекстЗапроса;
	
КонецФункции // СформироватьТекстЗапросаПоБюджету()

// Процедура удаляет элемент в коллекции полей схемы запроса.
//
// Параметры:
//  СхемаКоллекция - КолонкиСхемыЗапроса.
//  ИмяЭлемента - Строка.
//
Процедура УдалитьЭлементВКоллекцииСхемыЗапроса(СхемаКоллекция, ИмяЭлемента)

	Для каждого Эл Из СхемаКоллекция Цикл
	
		Если Эл.Псевдоним = ИмяЭлемента Тогда
		
			ИД = СхемаКоллекция.Индекс(Эл);
			СхемаКоллекция.Удалить(ИД);
			Возврат;
			
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры // УдалитьЭлементВКоллекцииСхемыЗапроса()
  
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
